document.addEventListener("DOMContentLoaded", () => {

  const selector = document.getElementById("theme-selector");

    // Загружаем сохранённую тему
    const savedTheme = localStorage.getItem("theme") || "theme-classic";
    document.body.className = savedTheme;

    // Если есть селектор — синхронизируем
    if (selector) selector.value = savedTheme;

    // Если есть селектор — слушаем изменение темы
    if (selector) {
        selector.addEventListener("change", () => {
            document.body.className = selector.value;
            localStorage.setItem("theme", selector.value);
        });
}

//////////////////////////////////////////////////////////
function animationTypingFromText(doc, speed = 100, date) {
//  const cursor = document.getElementById("anim_cursor");
  const text = doc.innerHTML ;
  let i = 0;
  doc.textContent = "";

  function animateTyping() {
    if (i <= text.length) {
      doc.innerHTML  = text.slice(0, i)  + "|";
      i++;
      setTimeout(animateTyping, speed);
    }else{
          doc.innerHTML  = text;
      if (date == true){
        doc.innerHTML  = text;
        const dateElement = document.getElementById("datetime");
        const now = new Date();
        const days = ["SUN","MON","TUE","WED","THU","FRI","SAT"];
        const dayOfWeek = days[now.getDay()];

        const day = String(now.getDate()).padStart(2, '0');
        const month = String(now.getMonth() + 1).padStart(2, '0');
        const year = now.getFullYear();

        dateElement.textContent = `| ${dayOfWeek} | ${day}.${month}.${year}`;
}
    }
  }
  animateTyping();
}
animationTypingFromText(document.getElementById("up-panel"), 15, true);
animationTypingFromText(document.getElementById("pos-text"), 60);
animationTypingFromText(document.getElementById("center-left-panel-text"), 35);
animationTypingFromText(document.getElementById("logo-text"), 45);
animationTypingFromText(document.getElementById("center-right-panel-text"), 60);
//////////////////////////////////////////////////////////
function animationLinesOnly(doc, lineDelay = 400) {
  const lines = doc.textContent.split("\n");
  doc.textContent = "";

  let i = 0;

  function nextLine() {
    if (i < lines.length) {
      doc.textContent += lines[i] + "\n";
      i++;
      setTimeout(nextLine, lineDelay);
    }
  }

  nextLine();
}

//animationLinesOnly(document.getElementById("center-left-panel"), 1000);
//animationLinesOnly(document.getElementById("center-right-panel"));
///////////////////////////////////////////////////////////////////////////////
    const quotes = [
    `я не знаю что мне делать
    как мне жить и кому верить
    не хочу я быть один
    но я выбился из сил`,

    `ты мне помоги искать тебя
    ведь я не могу простить себя
    за то что я был так беспечен
    и теперь прах твоей памяти вечен`,

    `снова я за тобою бегу и бегу
    но нигде и никак найти не могу
    эфемерные мысли о том как все было
    меня поглощают мое сердце остыло`,

    `помоги мне стать свободным
    не хочу я жить в болотном
    мире этом суетливом
    ведь он умер несчастливым`,

    `как же мне найти дорогу
    к дому что был неподалеку
    заплутал я уж совсем
    взор потерян смех проблем`,

    `и я снова повторяю
    что дневник твой проверяю
    на предмет любимых чисел
    ищущих сокрытый смысл`,

    `не увижу ничего
    смеха страниц лица твоего
    ведь там снова был пожар
    и тебя унес тот жар`
    ];

const randomIndex = Math.floor(Math.random() * quotes.length);
const quoteText = quotes[randomIndex];

const quoteElement = document.getElementById("quote");
let index = 0;

function type() {
    if (index < quoteText.length) {
        quoteElement.textContent += quoteText[index];
        index++;
        setTimeout(type, 100); // скорость печати
    }
}

setTimeout(type, 4000);
///////////////////////////////////////////////////////////////////////////////
const asciiArt =
`                                                                 ............        .
      :.                                                   ...........  ......................
                                                        .......                             . .....                 .
                                                 ..... ....                                       .....            .                ..
           . .                               ...::.  ...                                              ...        .      .           ..                   .
       .       ..                         ..:^:.    ..                               ...                .....         .                  .            ..   ..
        .  ....   .                    .:^:::.    ...                                 .::..               .:...      .. .  .     .    .   . .           .....
       ......     ...                :^^....     ....            ..                     .:::.               .:..       .  .  . .  .  . ..                  .....
    ...... .             .        .:^: .:..    .....    ..      ..               .       :..::.              .:..   .... ..  . .  .. .  .  .       ...         .
   .........   ......  ..        :^: .:^.     ...:^~:  ..      :.                ..       :. .^^:             ............. .. .. ..... .. .       ..      ..
 .........  ..... ......       :~: .:^^.     .. ...^: :.     :^::     .    .      :        :.  .~^.            ...:  ....   ..  .. ..... .....    ....    . ....
 ................   ...       ^~..:::^.    .:.    .~::^    .^~~:^    ..   ...     :.       .^    :~^.           ...... .    . .  .. .......   ................ .
 ......:::.....   ....       ~^ :^:.^.    .^:.    ^^.~:^. .^~~.::    :.   ::.     .:        .^     ^~:.    . ..........   ...... ..  .........  ................
......:...   ... . ..       ~^.~^..^.    :~^..:^: ..!:~~..:!7:.^     ^   .::       :         :.     .~^:.     .....  ............... .. .. ...........    ..:...
....... .   ... .....      :7:~: .^.    .~^:..~7^..^^.^.. ^~!.^.    .:   .~^       ^    .             ^~:::     .....:::...   ..............  ......        ....
  .......  ..   ....       !7~. .^.  ...^~^..:!~:::^.:^..~~:~^:     ::   :7~       ^    .:          .  .~^.^^.   .....::::~~:.........................        ..
.........  ......         .?~  :^   .:.:~~. .......^ .:.~7.~!^      ^.   !:! .     ^.    :.   .     .:   ^~..^^:.  ...:..::^~~~^:^::.... ...:..:.........      .
..:: ...........  ..  .. .!7! ^^   .::.~:.   ..  .::  ..7..^!.    . ^    ~.! :     ~:    .^   .:.    ::   .!^ .:~^.....:^^.  ..:^^~~~^^^^^^^^:....   ......
  ..::..::........   .. .!~ ~!^..  ....!     .   .:.   !^ .:..     .~   .~ 7.:.    ^^.    ::  :.!^.  .^:    ^!. .:^.... .^^:... ......:.:..    .....   ......
..::.:::.   ....       .~~  ^^ ^: ... ^^     .   .^.  ~7. ~^..   . .~   ^~ ~~.^   .~:^     ~:   :~:^:  ^^    .!^  ..:..:.  .:^^:..... ......     ......  .....
:...::.        .....   :!. ^~:::.. ::.~:        ..~. ^!:. 7:..   . :^   !: .7 ~   .!.^:    :!... ^^ ^~:.^^     ^!:...:.:!~^....^^^.:. .. ......    ......  ....
.....        ......    ~^ ^!~~^.. .^::!.        ..~.:7 :.:7:..  .. ^: ..J^. !^:^  .:.:~.   .~^::. ~^. :~^~~.    .!!.:^..!!^::^:::..:^^^^..........   .....    ..
...        ......  ....!:^7~~7^ . ^^:^!.        ..^.?: ^.!~...  .: ~:  ~7~!!!J.!. .::.7.:. .^^^.:. ~:   .^!7:     ~!^...:^^~~..:^~^::^^^^:^^::... .    .....  ..
        ...~:     ... .!~7~.77:...!::~~.       ..:^?~  ^~^^..... ^ !.. ?.    ^7:! .:^ 7.::  :~.^... !:     :7?^.  .:!7^..:::!!^:..:::!~^^^~~~~^^^~^^::::::.....
      .....           .^!!.77!:. ^~.:~~..   .  ...77   7! ^ .....^ ! :~!      ^!^~ .~ !:.:   ::.^:.:.!:      !J7!^...^~:..^^ ^!7!..:.:~^...:::^^^^~~~~~~^:....
    .....   ....      .~~:~7!~...!:.^!~ ..  . .. ~?.. ^? :7 ... ^::~.~?        :7!~.^.^~ .   .^ :^::^.~:      ~7~~!!~^:.:..~^ .:!J~:..:^!............     ....
   ....   .....       :!:~!~!~..^~. :!: .. .... :7~:.~?^ 7? .. .!.J:!?: ..       ~77^::! .:   ^. ^:::^^~^..    ^7^..^~~^::^:!^..:^J7:.:.^!:........:.   .  ....
   ...  .....      ...^~:!:!~^. ~^. :::....... :?.~~!~^.^7~ .. ^:!Y~7!^~~~^~?J?7~::~!!.! .~   ::.^:::.:^~^ ..   :~^:  .^::::^~^::..7!::: ^!:...:..... .... .....
       ...^:   . ....:~.7::!!~..~:. .::. ..   :?::7!. :~^!....:^!?7!:^~7?JYYYYJY55?77J7!. ~.   ^~^:..:: :!~  .   .^:::  .::^:..~!^:.^~~:. ~~:..::.:.  ..........
      ....  . .......^:~~ .7!~ .~.:  ^:...   ^?~~!.  .75?~  .:^!!7! :!7?7~~??!~~!77?!!?!. ~:   ~5!!^::~~. ~7:      ^:.:. ..:::..!7^^^^^!: .!:...::... .:.:. ....
      ...    . ......^^7..:!!! .^.~  :^:.:.:!J~^::  ~J!~~ .^~??7~:  ..     ~^:^~~77^^~^~:.~:   :Y7:.^~^~!^ .~~.     ^^ ::..::::::~7^:::~!^^!^:^..::.:..:..:.....
              .......:!^ .~!!: .^ ?: .!~^!!?!:. ^::~?J7!^^^:...            ^~:^~?~?^7~?7..^:.  .?~?~!7:  !!  :7~:  . ^^ .:..::.:!~~~!^.:7^.7~::...:.:..:..:.....
             ........^7..^~:~. .^.^7 .^!.!!...:!J7~~^!5?                   .?^~^!!~.^???. ^:.: .7 ?!^^^:. !^.  !!~^:. ^~   ...:.^~!77?7:!!!7:.....:.::.:.::.....
             .......:!~..~::^:.^^: ?.::?~..:^^^~??!7!~^   ..               .!???!!~!77??. ~..^ :!.?~:^7:^.~: :. ^^:^~~.^^   .....:~^^!7J?7?~......:..:.::::
              ....: ^J^..~::^:~?~^ ~?:.?^..!...         ::.:.               ..:^~::^~: 7  ~ .^ 77~:   ?^.:!.  .:.:^ .:^~!~    .....^~..7?^?!::.  .::.:....
...           ...:..^?~ ^^::^^!:7~:.7! !^. ^~~~::...:..^:.^:                          .7 .~ ^::5^  .:!Y!~~:.    :::^.  .:77^^:......:~!?777!!!7!::::.::.
.::. ........      .:??.^^::^~~ :7~.^7~:!.. 7::..:...  :^!^                ......:... ^~    ~^!^^^~!77~^:....    .^::  . .!^.^^^^^^:..:!:7!:.^~!~~^:.::.
.... ....       ....^7?Y!:.^!!:  :!~: 7!7.. ^~                              . . ...   7.~~ :~7^:~!!?7.........     ^::    .!. ...:^~^^:^??!:......::.::..   ..
    ............... ^! 7Y?^~!7.   ^!.  ~J? : !.                                      :!:?! ~~:^~~~^:!^.........     .:.    ^!  .........:^?!~~~^::::::.  ....
     ...............:!..!7J?~7:   :..   ^Y7.:.!.          .^...  ..:.                7~~!^!J^.....^~:^!:.........     ..    !:............^~:^!~^^~!!~~!7^.
...........:.........7..~. :?!!   :..  .: J?!~:^^.         ..:^ .^^~:          .  .^?7^:7~7~^.:::..:~^^!^...........   ..   :! ............:::^^^~~!7JJ!^.
.....::.....:........?: ~:  7^7: :::.  :  :?~~!~~!!:.^^                        :^^~~^^!J7~ :^ ..::...:^~~:...........   .:   !.  ....:...... :~^^^~~^:.....
.:::..:^:::.~~.......~! ~^  ^?^!:^:.  ..  .:7. .::^^~?:                            :^.!?~  .~   ...:....:.:::.....  ...  .:  ~^ .....:^~^.   :7~::::.   ....
:^^. ..:::.:~~.....::.7.:~   77:^::.  :.  . .7^    ...:^^.                  .:^.     7J:    ~.  ..:.........^^....     .. .: :^ ......^^^~:   :~~^:....  ....
:..........::.......::~! ~^  .J^ :.  ..   .   77.    .. .^^:.         ...:^~^^..^::~7!      .?!~!!^~:...      ......     . :.:: .......~::7.  .^^^^::. ....
............:....!^::::~!.~:  :?:^. ..... ..   ^!~.    ..  .^^:...:^!!~:...     .:::      .:~7~:   :!:^^:.      . . ..    ...^^ ........!.!! ..!!:^:::. ....
.:....:.:....  ..::.....~!.:: .?^: .. ... ..     ^!!^.   .....::::::~!  .              .^~~^.       ~:.:^:.:.......   ..   ..!:  ... ...^!:J.  ^?.....   ....
.:.::::::...:......    . :!:. ~7^: . ..:  .:      .:~~~^:........    ^~^^           .^~~^.          .?: ...^~........  .   ..7.  .::.....~^7:. ^?.....    ....
:..::^.:.:::..  ....... .. ^~:?~~... ...   :    ...   .:^~~~^^~^~^^:. !7         .^~~:.              7J~....^~..~^..........~~  ..:^^:...:!7 . ~7:...:.    ...
. .:.::.:.:...........:..    :J:~..  ...   :     ..:.    ......:~:^~~!!J      .^!~:.                 :!~?:.:^:^!!7:::::....:7......:^^....~^  :7^^^:.
...::.:...:........ .::.:.   .?.!:. ..     .. ..   ... ..........^!7!: !7  :~!~:.                     ~~:7~^^~~^7~:.^^:....!:.......:^....  .~J^:^::^:
.:..::::..::...::.    ...:.   ?:~:...       :.:..   .:.     ..  :~7^    J!!!^.                         ^!^!^^:!7^:~...^~:.^:............. :!7!.  .::.::     .
.:..::.....::....:..    ...   7!^~...       ::....    .:.     :!7^.  .^77^.                             .!?7~  ^J:~!:.:~7^?~: ...........^7^.      .... ..  ..
.........:. .........         .J~!.          ^ ......  ..:..:!!^. .^!!~^                               :~~:.:~^ :7JJ^::.77!~~: ....      .!7~:..        ... ...
..........:.    .   ...        :J?~.     .:  .. ......   .^!~:  ^~?!.                                .!!^.    ^!: !?~.^!:7J^.!:   .!~:     .^!7~^:      .......
...........:.     .   .         .!?~.         .   ..:... .Y~   ^!:^?^                               ^!:  .      ^!::?7^..!~..:7. .^!YJ7!~:.   .^^!!!!~..:::. .
..  ...........           .:      .7!:     .. ..    .::.. ^7~  ^!^^.!!      .                     :7~     .      .!~:??: ...: !^ ~!!7??~^~!!!~~~~~!77~. ....
.........     ..                   !7!.   .::....     .:::..~:!~. .: ~7. .^~:                   .!7:      ..   ... :!^^?!...:.^~^?..^!???!~^.......   . ....
.........      ..                  :J7^   ..:!^..:.      .:::...:::::.~!7!^                    ^7~         ^.        ~!:~?~...^7J: .  ::^~!!^::.::.. ... ..
... .. ...      ..                  !J7.   . .~!^:::.      :!~7~:::~~!:.?:                   :!!.           ^         :!^.7J^~??:    . ...     ..    ....
... .. ...      ..                   ~J7.  ..  .:^^^~!!~~:::J^Y?!~?J!^. :?:                .!!:             .:          ^~.:?Y^ . . ..  ...          ....
...... ....   ...                     .^^..  ..    ..::.:..:?~!J7?!: ..  .7:             .^!^.               ~:          .~^.!J:..... .  ...     .
...... .... ..                            ... ....         ?..:Y!: ..   ..:?:          .~!~^.    .............^.           :~^^J7. ... ....  ... ...
        ..  ..                              ....::.        !^~!?::.:.:::^^::~^^^^^^^^^^^^^^^:^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^:^!~~7:  .. .... .... ...`;
const asciiElement = document.getElementById("ascii-image");
   const lines = asciiArt.split("\n"); // делим на строки
   let index1 = 0;

   function typeLine() {
       if (index1 < lines.length) {
           asciiElement.innerHTML += lines[index1] + "<br>"; // добавляем строку
           index1++;
           setTimeout(typeLine, 50); // задержка между строками
       }
   }
   typeLine();
///////////////////////////////////////////////////////////////////////////////
function spinner(){
  const spinner = ['|', '/', '-', '\\'];
let i = 0;

setInterval(() => {
  document.getElementById('spinner').textContent = spinner[i % spinner.length];
  i++;
}, 150);
}
spinner();
///////////////////////////////////////////////////////////////////////////////
function glitch(count = 2) {
  const chars = '!"#$%&\'()*+,-./0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~';
  const elements = document.querySelectorAll('.glitch');

  elements.forEach(el => {
    const min = 200;  // минимальная скорость
    const max = 400;  // максимальная скорость
    const speed = Math.random() * (max - min) + min;


    setInterval(() => {
      let out = '';

      for (let i = 0; i < count; i++) {
        out += chars[Math.floor(Math.random() * chars.length)];
      }

      el.textContent = out;
    }, speed);
  });
}

     setTimeout(glitch, 12000); // задержка между строками
//////////////////////////////////////////////////////////////////////////

});
